export const SYSTEM_MESSAGES = {
  RATE_LIMIT: {
    title: "היי חברים! 👋",
    content:
      "נראה שהתלהבתם מהכלי שלנו (וזה מעולה!), אבל כדי לתת שירות טוב לכולם, יש לנו הגבלה של מספר בדיקות ליום.",
    cta: "נשמח לראות אתכם שוב מחר! 🌅",
  },

  PERSONAL_DETAILS: {
    title: "כמה פרטים קטנים ונשלח לך דו״ח מקיף עם כל התובנות",
    form: {
      name: "שם (יופיע על הדו״ח) 📋",
      email: "מייל (לשליחת הדו״ח המפורט) 📧",
      phone: "נייד (לשיתוף תובנות נוספות) 📱",
    },
    safeDetails: "הפרטים שלך בטוחים איתנו 🔒",

    statusMessage: {
      success: "הדוח נשלח אליך",
      fail: "שליחת המייל נכשלה, נסה שוב מאוחר יותר",
      required: "יש למלא את כל השדות",
    },
  },

  FAILED_SCAN: {
    title: "אופס! עבר יותר מדי זמן... 🕒",
    content:
      "הסריקה שביצעת כבר לא תקפה, אבל אל דאגה! אפשר לבצע סריקה חדשה בקלות",
    cta: "לסריקה חדשה 🔄",
  },

  SITE_FAILED_SCAN: {
    title: "לא הצלחנו למצוא את האתר 🔎",
    content: "נראה שהאתר לא נגיש כרגע, בדקו שהכתובת תקינה ונסו שוב",
    cta: "לבדיקה חדשה 🔄",
  },
  DEFAULT_FAILED_SCAN: {
    title: "משהו השתבש... 🤔",
    content: "אנחנו מתנצלים על התקלה, נשמח שתנסו שוב בעוד מספר דקות",
    cta: "לניסיון נוסף 🔄"
  },
  SURVEY: {
    statusMessage: {
      success: "המשוב נשלח בהצלחה, כבר תחזור לעמוד הראשי",
      fail: "שליחת המשוב נכשלה",
      required: "יש למלא את כל השדות",
    },
  },
};
